# GridlinesOutsideWillBeRedependent Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..GridlinesOutsideWillBeRedependent Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Type associated curtain grid lines outside of the edited wall boundaries will be made dependent again in order that they remain on the wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GridlinesOutsideWillBeRedependent { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridlinesOutsideWillBeRedependent As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GridlinesOutsideWillBeRedependent {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace